<p style="font-size:30px; text-align:center; line-height:120%">
<br>
COMS W 4111-03, H03, V03<br>
Introduction to Databases<br>
Spring 2019 Take Home Midterm
</p>

# Exam Overview and Instructions

- Homework assignments and exams have point values that contribute to the final grade. Final grade depends on total point value. The range of total possible points for a semester is 0 to 100 points.
    - The grade for this midterm is in the range 0 to 100. The sum of the point values of the questions is 110 points. You can answer all questions and your grade will be the sum of the points up to a maximum of 100. Answering all questions cannot decrease your grade. The point values of the questions is:
        - Section 3 has 5 questions that require writing SQL queries. Each questions is work 10 points.
        - Sections 4, 5, 6 and 7 each have one question woth 15 points.
    - __This midterm exam is contributes 20 points__ for your final semester point total. So, divide your score on this exam by 5 to determine point contribution.


- Submission:
    - The exam is due on Sunday, 17-Mar-2018 at 11:59PM. __You may not use grace days.__
    - Submission:
        - Submission format is a zip file containing this Jupyter Notebook with your solutions entered into the code cells or Markdown cells for each question. If you embed images or diagrams, you need to include the images in the zip file.
        - The file name must be of the form "uni_midterm_s_2019.zip" Replace the string "uni" with your uni. Please do not submit a file without performing the replacement.
        - You submit your homework on CourseWorks under [Midterm Examination](https://courseworks2.columbia.edu/courses/79571/assignments/274101) assignment.
        - No other formats are allowed.
        - If the notebook format is incorrect or the notebook is corrupted, the grade is 0.
        - Submissions after the due date and time are not allowed. Submissions not received on time receive a grade of 0.
    - Respect for the individual is paramount. We will accommodate special circumstances, but we must be notified and discuss __in advance.__
    

- Exam Rules:
    - Please read and review the [Academic Integrity policy and guidelines](https://www.college.columbia.edu/academics/academicintegrity), including subsections and details. This material defines the base rules for this exam regardless of your school.
    - No student collaboration of any form is permitted. You may not share material of any form, including links to on-line information, __information from the preparatory recitation section,__ suggestions or ideas, etc.
    - You __MAY__ use material from office hours or recitations.
    - You __MAY__ use any on-line information you find, but may not directly use code you find. You must cite any on-line sources in the comments Markdown cell for each questions.
    - You must privately send comments or questions to Professor Ferguson __via email.__ If questions or comments demonstrate a need for clarification or correction, Prof. Ferguson will update this document and post the correction information on this and only this [Piazza topic.](https://piazza.com/class/jpltphl4wz76cm?cid=595)
    - You may not discuss the exam on Piazza. Private posting and anonymous post is disabled during the midterm examination period, and will be re-enabled after the midterm.

- Completing the exam:
    - Environment:
        - You must use an unmodified, original lahman 2017 database for many of the questions.
        - Other questions ask you to create a database/schema. The questions provide instructions.
        - You can load the original Lahman 2017 database by downloading and unzipping this file: [lahman2017raw.sql](https://courseworks2.columbia.edu/files/4377424/download?download_frd=1)
            - You can import the data and create the database in MySQL Workbech.
            - Use the menu function "Server->Data Import." 
            - Check the option "Import from Self-Contained File."
            - Make sure that "Dump Structure and Data" is chosen in the selection in the last row of the import wizard.
        - You must install and use [%%SQL Magic for iPtython](https://github.com/catherinedevlin/ipython-sql) for executing any SQL statements in code cells.
        - Section 2 tests the setup of your environment. You __MUST USE__  dbuser:dbuserdbuser@localhost/lahman2017raw. 
        - Your database __MUST HAVE__ a user ```dbuser``` with pasword ```dbuserdbuser```
    - Each question starts with an explanation of the structure of the answer, e.g. prose, diagram, SQL, etc.
    - Questions requiring SQL or code have empty code cells where you enter your statements. Some also contain sample answers to help you determine if your answer is correct. You must show the execution of your SQL in your submission. You may use LIMIT 10 to reduce the size of results.
    - Some of the queries may take several minutes to complete. In module II, we will demonstrate how to improve query performance using indexes.

# Environment Test

This section tests the environment. You must change the "userid:pw" to "dbuser:dbuserdbuser" for your MySQL instance. Unless you have received an exception, you __MUST USE dbuser:dbuserdbuser.__

## SQL Magic Plugin

In [1]:
%load_ext sql
%sql mysql+pymysql://dbuser:dbuserdbuser@localhost/lahman2017raw
        
%sql select * from people where playerid='willite01'

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
1 rows affected.

[('willite01', '1918', '8', '30', 'USA', 'CA', 'San Diego', '2002', '7', '5', 'USA', 'FL', 'Inverness', 'Ted', 'Williams', 'Theodore Samuel', '205', '75', 'L', 'R', '1939-04-20', '1960-09-28', 'willt103', 'willite01')]

## Helper Python Libraries

### Imports

In [2]:
import pymysql
import json
import copy
import pymysql.cursors

"""
The core exceptions that PyMySQL throws. A data access abstraction layer like XXXDataTable
would convert to a common set of data technology independent exceptions. This enables a single
application code base for accessing data.

Just FYI. I do not use in this code.
"""
pymysql_exceptions = (
    pymysql.err.IntegrityError,
    pymysql.err.MySQLError,
    pymysql.err.ProgrammingError,
    pymysql.err.InternalError,
    pymysql.err.DatabaseError,
    pymysql.err.DataError,
    pymysql.err.InterfaceError,
    pymysql.err.NotSupportedError,
    pymysql.err.OperationalError)

### Connection Management and JSON Helpers

In [3]:
# Default connection info to use if caller does not specify one.
_default_connect_info = {
        'host': 'localhost',
        'user': 'dbuser',
        'password': 'dbuserdbuser',
        'db': 'lahman2017raw',
        'port': 3306
    }

# Shared, default connection to use if the caller does not provide a specific
# connection.
_default_cnx = pymysql.connect(
               _default_connect_info['host'],
                _default_connect_info['user'],
                _default_connect_info['password'],
                _default_connect_info['db'],
            charset='utf8mb4',
            cursorclass=pymysql.cursors.DictCursor)

# A pool of names connections.
_connections = {}


def safe_json_dump(o):
    """

    :param o: Object to dump to a string.
    :return: json.dumps() with default=str or text if cannot convert to JSON.
    """

    try:
        result = json.dumps(o, indent=2, default=str)
    except Exception as e:
        result = "Not JSON - " + print(o)

    return result


def get_connection(c_name, host=None, port=None, user=None, password=None, db=None):
    """

    :param c_name: Name of a possibly pre-created connection.
    :param host: Host for a new connection
    :param port: Port for a new connection
    :param user: User for a new connection.
    :param password: Password for new connection.
    :param db: DB/schema to connect to.
    :return: The pre-created connection if it exists, or a connection created with the
    passed parameters.
    """

    try:
        cnx = _connections.get(c_name, None)
    
        if cnx is None:
            c_info = copy.copy(_default_connect_info)
            if host is not None:
                c_info['host'] = host
            if port is not None:
                c_info['port'] = port
            if user is not None:
                c_info['user'] = user
            if password is not None:
                c_info['password'] = password
            if db is not None:
                c_info['db'] = db
            c_info['charset']= 'utf8mb4'
            c_info['cursorclass'] = pymysql.cursors.DictCursor
                
            cnx = pymysql.connect(**c_info)


    except Exception as e:
        print("Connect failure, e = ", e)
        raise e

    return cnx

### Helper Method for Running Query

__NOTE:__ Do not worry about the commit, cursor, etc. parameters. This is set up for module II topics.

In [4]:
def run_q(cnx=None, q=None, args=None, fetch=False, commit=True, cursor=None, rowid=None):
    """

    :param cnx: Caller supplied connection to use. One is created, if none.
    :param q: Query string
    :param args: Args for insertion to replace %s parameters
    :param fetch: Return the resulting rowset. If False/None, return the response code from
    the cursor operation.
    :param commit: Commit the transaction if true.
    :param cursor: Cursor to use for operation. One is created if None.
    :param rowid: Get and return auto-increment rowid if true.

    :return: Rowset from fetchall, cursor RC or rowid depending of parameters.
    """

    result = None

    try:
        connection_created = False

        if cursor is None:
            if cnx is None:
                cnx = get_connection(c_name=None)
                connection_created = True

            cursor = cnx.cursor()

        qs = cursor.mogrify(q, args)
        #print("Mogrified cursor = ", qs)

        result = cursor.execute(q, args)


        if fetch:
            result = cursor.fetchall()
        else:
            if rowid:
                result = cursor.lastrowid

        if commit:
            cnx.commit()
        if connection_created:
            cnx.close()

    except pymysql_exceptions as original_e:
        print("Original exception = ", original_e)

        if commit:
            cnx.rollback()

        if connection_created:
            cnx.close()

        raise (original_e)

    return result

In [5]:
run_q(cnx=None, q="select playerID, nameLast, nameFirst from people where playerid = %s", 
      args=('willite01'), fetch=True)

[{'nameFirst': 'Ted', 'nameLast': 'Williams', 'playerID': 'willite01'}]

# SQL Data Manipulation Language Questions

## Complex Query $-$ Performance Statistics by Year (10 points)

### Question

- Use the ```lahman2017raw``` database/schema.


- Create an annual performance summary table using a single query statement. 


- The columns are:
    - From ```people:``` ``` playerID, nameLast, nameFirst, birthYear, deathYear, bats, throws```
    - From ```appeareances:``` ```teamid, yearid, g_all```
    - From ```batting:``` 
        - The underlying columns are ```ab, h, hr, rbi```
        - The row for a ```teamID, yearID``` is the sum for the year.
    - From ```fielding:``` 
        - The underlying columns are ```a, e, po```
        - The row for a ```teamID, yearID``` is the sum for the year.
    - From ```pitching:``` 
        - The underlying columns are ```g, w, l```
        - The row for a ```teamID, yearID``` is the sum for the year.


- Test your result for playerID 'martipe02'


- __Note:__
- Your query must produce the correct results for any ```playerID.``` We will text using other ```playerIDs.```
- Your column names and values __MUST__ match the same answer.

### Answer

In [15]:
%%sql

select * from 
    (select playerid, nameLast, nameFirst, birthYear, deathYear, bats, throws from people) as a 
    join
    (select playerid, teamid, yearid, g_all from appearances) as b
on a.playerid = b.playerid
limit 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
10 rows affected.

[('abercda01', 'Abercrombie', 'Frank', '1850', '1939', '', '', 'abercda01', 'TRO', '1871', '1'),
 ('addybo01', 'Addy', 'Bob', '1842', '1910', 'L', 'L', 'addybo01', 'RC1', '1871', '25'),
 ('allisar01', 'Allison', 'Art', '1849', '1916', '', '', 'allisar01', 'CL1', '1871', '29'),
 ('allisdo01', 'Allison', 'Doug', '1846', '1916', 'R', 'R', 'allisdo01', 'WS3', '1871', '27'),
 ('ansonca01', 'Anson', 'Cap', '1852', '1922', 'R', 'R', 'ansonca01', 'RC1', '1871', '25'),
 ('armstbo01', 'Armstrong', 'Robert', '1850', '1917', '', '', 'armstbo01', 'FW1', '1871', '12'),
 ('barkeal01', 'Barker', 'Al', '1839', '1912', '', '', 'barkeal01', 'RC1', '1871', '1'),
 ('barnero01', 'Barnes', 'Ross', '1850', '1915', 'R', 'R', 'barnero01', 'BS1', '1871', '31'),
 ('barrebi01', 'Barrett', 'Bill', '', '', '', '', 'barrebi01', 'FW1', '1871', '1'),
 ('barrofr01', 'Barrows', 'Frank', '1844', '1922', '', '', 'barrofr01', 'BS1', '1871', '18')]

In [35]:
%%sql
SELECT
    people.playerid, people.nameLast, people.nameFirst, birthyear,
    if(length(deathYear)>0, deathYear, "--") as deathYear, bats, throws,
    appearances.teamid, appearances.yearid, appearances.g_all,
    ifnull(batting_year.ab,0) as ab, ifnull(batting_year.h,0) as h, ifnull(batting_year.hr,0) as hr,
        ifnull(batting_year.rbi,0) as rbi,
    ifnull(fielding_year.a,0) as a, ifnull(fielding_year.e,0) as e, ifnull(fielding_year.po, 0) as po,
    ifnull(pitching_year.p_g,0) as p_g, ifnull(pitching_year.w,0) as p_w, ifnull(pitching_year.l,0) as l
from 
    people left join appearances using(playerid)
    left join (select playerID, teamid, yearid, sum(ab) as ab, sum(h) as h, sum(hr) as hr,
               sum(rbi) as rbi from batting
        group by playerid, teamid, yearid) as batting_year
on 
    appearances.playerid = batting_year.playerid and appearances.teamid = batting_year.teamid
        and appearances.yearid=batting_year.yearid
left join
    (select playerid, teamid, yearid, sum(a) as a, sum(e) as e, sum(po) as po
        from fielding group by playerid, teamid, yearid, stint, pos) as fielding_year
on appearances.playerid=fielding_year.playerid and
    appearances.teamid=fielding_year.teamid and
    appearances.yearid=fielding_year.yearid
left join 
    (select playerid, yearid, teamid, sum(g) as p_g, sum(w) as w, sum(l) as l
        from pitching group by playerid, teamid, yearid) as pitching_year
on
    appearances.playerid=pitching_year.playerid and appearances.teamid=pitching_year.teamid
        and 
        appearances.yearid=pitching_year.yearid
where 
    people.playerid = 'martipe02'

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
18 rows affected.

[('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '1998', '33', 7.0, 0.0, 0.0, 0.0, 18.0, 4.0, 11.0, 33.0, 19.0, 7.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '1999', '31', 2.0, 0.0, 0.0, 0.0, 15.0, 1.0, 13.0, 31.0, 23.0, 4.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '2000', '29', 0.0, 0.0, 0.0, 0.0, 28.0, 0.0, 14.0, 29.0, 18.0, 6.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '2001', '18', 0.0, 0.0, 0.0, 0.0, 5.0, 0.0, 5.0, 18.0, 7.0, 3.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '2002', '30', 5.0, 0.0, 0.0, 0.0, 16.0, 2.0, 16.0, 30.0, 20.0, 4.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '2003', '29', 3.0, 0.0, 0.0, 0.0, 20.0, 0.0, 14.0, 29.0, 14.0, 4.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '2004', '33', 2.0, 0.0, 0.0, 0.0, 16.0, 1.0, 16.0, 33.0, 16.0, 9.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'LAN', '1992', '2', 2.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 2.0, 0.0, 1.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'LAN', '1993', '66', 4.0, 0.0, 0.0, 0.0, 4.0, 0.0, 4.0, 65.0, 10.0, 5.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'MON', '1994', '24', 44.0, 4.0, 0.0, 5.0, 15.0, 4.0, 9.0, 24.0, 11.0, 5.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'MON', '1995', '30', 63.0, 7.0, 0.0, 2.0, 23.0, 2.0, 14.0, 30.0, 14.0, 10.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'MON', '1996', '33', 64.0, 6.0, 0.0, 4.0, 17.0, 3.0, 11.0, 33.0, 13.0, 10.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'MON', '1997', '31', 69.0, 8.0, 0.0, 0.0, 31.0, 1.0, 7.0, 31.0, 17.0, 8.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'NYN', '2005', '31', 69.0, 6.0, 0.0, 1.0, 19.0, 0.0, 6.0, 31.0, 15.0, 8.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'NYN', '2006', '23', 38.0, 4.0, 0.0, 1.0, 13.0, 5.0, 7.0, 23.0, 9.0, 8.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'NYN', '2007', '5', 9.0, 1.0, 0.0, 0.0, 0.0, 0.0, 1.0, 5.0, 3.0, 1.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'NYN', '2008', '20', 39.0, 6.0, 0.0, 4.0, 17.0, 0.0, 6.0, 20.0, 5.0, 6.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'PHI', '2009', '9', 14.0, 1.0, 0.0, 1.0, 6.0, 0.0, 1.0, 9.0, 5.0, 1.0)]

In [32]:
%%sql
select 
    people.playerid, people.namelast, people.namefirst, birthyear,
    if(length(deathyear)>0, deathyear, "--") as deathyear, bats, throws,
    appearances.teamid, appearances.yearid, appearances.g_all,
    ifnull(batting_year.ab, 0) as ab, ifnull(batting_year.h, 0) as h,
        ifnull(batting_year.hr, 0) as hr, ifnull(batting_year.rbi, 0) as rbi,
    ifnull(fielding_year.a, 0) as a, ifnull(fielding_year.e, 0) as e, ifnull(fielding_year.po, 0) as po,
    ifnull(pitching_year.p_g, 0) as p_g, ifnull(pitching_year.w, 0) as w, ifnull(pitching_year.l, 0) as l
from
    people left join appearances using(playerid)
    left join ((select playerid, teamid, yearid, sum(ab) as ab, sum(h) as h, sum(hr) as hr,
               sum(rbi) as rbi from batting
        group by playerid, teamid, yearid) as batting_year)
on
    appearances.playerid = batting_year.playerid 
    and appearances.teamid = batting_year.teamid
    and appearances.yearid = batting_year.yearid
left join
    (select playerid, teamid, yearid, sum(a) as a, sum(e) as e, sum(po) as po
        from fielding group by playerid, teamid, yearid, stint, pos) as fielding_year
on 
    appearances.playerid = fielding_year.playerid
    and appearances.teamid = fielding_year.teamid
    and appearances.yearid = fielding_year.yearid
left join
    (select playerid, yearid, teamid, sum(g) as p_g, sum(w) as w, sum(l) as l
        from pitching group by playerid, teamid, yearid, stint, pos) as pitching_year
on
    appearances.playerid = pitching_year.playerid
    and appearances.teamid = pitching_year.teamid
    and appearances.yearid = pitching_year.yearid
where
    people.playerid = "martipe02";

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ')\non\n    appearances.playerid = batting_year.playerid \n    and appearances.teami' at line 13") [SQL: 'select \n    people.playerid, people.namelast, people.namefirst, birthyear,\n    if(length(deathyear)>0, deathyear, "--") as deathyear, bats, throws,\n    appearances.teamid, appearances.yearid, appearances.g_all,\n    ifnull(batting_year.ab, 0) as ab, ifnull(batting_year.h, 0) as h,\n        ifnull(batting_year.hr, 0) as hr, ifnull(batting_year.rbi, 0) as rbi,\n    ifnull(fielding_year.a, 0) as a, ifnull(fielding_year.e, 0) as e, ifnull(fielding_year.po, 0) as po,\n    ifnull(pitching_year.p_g, 0) as p_g, ifnull(pitching_year.w, 0) as w, ifnull(pitching_year.l, 0) as l\nfrom\n    people left join appearances using(playerid)\n    left join ((select playerid, teamid, yearid, sum(ab) as ab, sum(h) as h, sum(hr) as hr,\n               sum(rbi) as rbi from batting\n        group by playerid, teamid, yearid) as batting_year)\non\n    appearances.playerid = batting_year.playerid \n    and appearances.teamid = batting_year.teamid\n    and appearances.yearid = batting_year.yearid\nleft join\n    (select playerid, teamid, yearid, sum(a) as a, sum(e) as e, sum(po) as po\n        from fielding group by playerid, teamid, yearid, stint, pos) as fielding_year\non \n    appearances.playerid = fielding_year.playerid\n    and appearances.teamid = fielding_year.teamid\n    and appearances.yearid = fielding_year.yearid\nleft join\n    (select playerid, yearid, teamid, sum(g) as p_g, sum(w) as w, sum(l) as l\n        from pitching group by playerid, teamid, yearid, stint, pos) as pitching_year\non\n    appearances.playerid = pitching_year.playerid\n    and appearances.teamid = pitching_year.teamid\n    and appearances.yearid = pitching_year.yearid\nwhere\n    people.playerid = "martipe02";'] (Background on this error at: http://sqlalche.me/e/f405)

### Notes, Comments

__Note:__
- You may add any comments or clarifications here.
- This is optional.
- Double click on this cell/text to open the Markdown edit box.
- You do not need to use markdown and can just enter text.
- There are many Markdown tutorials on the web, e.g. [this tutorial](https://www.markdowntutorial.com/)

## Determine People who Played for and Managed the Same Team in their Career<br> (10 points)

### Question

- A person (```playerID```) played for a team (```teamID```) if there is an entry for the ```playerid, teamid``` combination in ```appearances.```


- A person (```playerID```) managed a team (```teamID```) if there is an entry for the ```playerid, teamid``` combination in ```managers.```


- Write a query that returns a table containing rows for people who played for and managed the same team, but not necessarily in the same year.


- The resulting table should have the following columns:
    - From ```people: playerID``` and first_name, last_name
    - From ```appearances: teamID``` and the total games played for the team
    - From ```Managers:``` the total number of games managed.
    - The result should also contain: ```first_year, last_year.``` first_year is the earliest of the first row in ```managers``` or ```players``` and last_year is the latest year the person played or managed for the team.
    

- The resulting table __MUST__
    - Be ordered by last_year, descending and use limit 10.
    - Match the column names, column values, etc. in the sample answer.


- Your query may use only one ```JOIN.```

### Answer

In [13]:
%%sql

10 rows affected.

[('ausmubr01', 'Ausmus', 'Brad', 'DET', 352.0, 646.0, '1996', '2017', 998.0),
 ('cashke01', 'Cash', 'Kevin', 'TBA', 13.0, 486.0, '2005', '2017', 499.0),
 ('counscr01', 'Counsell', 'Craig', 'MIL', 711.0, 461.0, '2004', '2017', 1172.0),
 ('francte01', 'Francona', 'Terry', 'CLE', 62.0, 808.0, '1988', '2017', 870.0),
 ('girarjo01', 'Girardi', 'Joe', 'NYA', 379.0, 1620.0, '1996', '2017', 1999.0),
 ('mackape01', 'Mackanin', 'Pete', 'PHI', 18.0, 412.0, '1978', '2017', 430.0),
 ('mathemi01', 'Matheny', 'Mike', 'SLN', 622.0, 972.0, '2000', '2017', 1594.0),
 ('molitpa01', 'Molitor', 'Paul', 'MIN', 422.0, 486.0, '1996', '2017', 908.0),
 ('roberda07', 'Roberts', 'Dave', 'LAN', 302.0, 324.0, '2002', '2017', 626.0),
 ('venturo01', 'Ventura', 'Robin', 'CHA', 1254.0, 810.0, '1989', '2016', 2064.0)]

In [66]:
%%sql
select
    a.playerid,
    (select nameLast from people where a.playerid = people.playerid) as last_name,
    (select nameFirst from people where a.playerid = people.playerid) as first_name,
    a.teamid, a.player_p as g_played, b.player_m as g_managed,
        if (a.p_min_yearid<b.m_min_yearid, a.p_min_yearid, b.m_min_yearid) as first_year,
        if (a.p_max_yearid>b.m_max_yearid, a.p_max_yearid, b.m_max_yearid) as last_year,
        /*a.p_min_yearid,
        b.m_max_yearid, b.m_min_yearid, */
        (a.player_p + b.player_m) as total_g
from 
    (select playerid, teamid, min(yearid) as p_min_yearid, max(yearid) as p_max_yearid,
        sum(g_all) as player_p from appearances group by playerid, teamid) as a
join
    (select playerid, teamid, min(yearid) as m_min_yearid, max(yearid) as m_max_yearid,
        sum(g) as player_m from managers group by playerid, teamid) as b
on
    a.playerid = b.playerid and a.teamid = b.teamid
order by
    last_year desc
limit 10

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
10 rows affected.

[('girarjo01', 'Girardi', 'Joe', 'NYA', 379.0, 1620.0, '1996', '2017', 1999.0),
 ('ausmubr01', 'Ausmus', 'Brad', 'DET', 352.0, 646.0, '1996', '2017', 998.0),
 ('molitpa01', 'Molitor', 'Paul', 'MIN', 422.0, 486.0, '1996', '2017', 908.0),
 ('cashke01', 'Cash', 'Kevin', 'TBA', 13.0, 486.0, '2005', '2017', 499.0),
 ('counscr01', 'Counsell', 'Craig', 'MIL', 711.0, 461.0, '2004', '2017', 1172.0),
 ('mathemi01', 'Matheny', 'Mike', 'SLN', 622.0, 972.0, '2000', '2017', 1594.0),
 ('mackape01', 'Mackanin', 'Pete', 'PHI', 18.0, 412.0, '1978', '2017', 430.0),
 ('francte01', 'Francona', 'Terry', 'CLE', 62.0, 808.0, '1988', '2017', 870.0),
 ('roberda07', 'Roberts', 'Dave', 'LAN', 302.0, 324.0, '2002', '2017', 626.0),
 ('venturo01', 'Ventura', 'Robin', 'CHA', 1254.0, 810.0, '1989', '2016', 2064.0)]

### Notes, Comments

## Determining Lifespan (10 points)

### Question

1. A person was a player if their playerID appears in ```Lahman2017.appearances.```
<br><br>
1. A person is "known to be dead" if ```people.deathYear``` is NOT ```''``` (the empty string)
<br><br>
1. Return a table that contains the ten players and former players known to be dead with the longest lifespans. The table's rows should contain:
    - playerID
    - nameLast
    - nameFirst
    - DOD (Date of Death) in the format (YYYY-MM-DD)
    - DOB (Date if Birth) in the format (YYYY-MM-DD)
    - lifespan, number of days between DOD and DOB, in days.
<br><br>
1. Your table must match the column names and column values in the sample answer.

### Answer

10 rows affected.

[('hoffch01', 'Hoff', 'Red', datetime.date(1891, 5, 8), datetime.date(1998, 9, 17), 39213),
 ('marreco01', 'Marrero', 'Connie', datetime.date(1911, 4, 25), datetime.date(2014, 4, 23), 37619),
 ('wrighbo01', 'Wright', 'Bob', datetime.date(1891, 12, 13), datetime.date(1993, 7, 30), 37119),
 ('parkeac01', 'Parker', 'Ace', datetime.date(1912, 5, 17), datetime.date(2013, 11, 6), 37063),
 ('malinto01', 'Malinosky', 'Tony', datetime.date(1909, 10, 7), datetime.date(2011, 2, 8), 37014),
 ('swanska01', 'Swanson', 'Karl', datetime.date(1900, 12, 17), datetime.date(2002, 4, 3), 36997),
 ('daleyjo01', 'Daley', 'John', datetime.date(1887, 5, 25), datetime.date(1988, 8, 31), 36988),
 ('otisbi01', 'Otis', 'Bill', datetime.date(1889, 12, 24), datetime.date(1990, 12, 15), 36880),
 ('stilero01', 'Stiles', 'Rollie', datetime.date(1906, 11, 17), datetime.date(2007, 7, 22), 36772),
 ('werbebi01', 'Werber', 'Billy', datetime.date(1908, 6, 20), datetime.date(2009, 1, 22), 36741)]

In [40]:
%%sql

select playerid, nameLast, nameFirst, 
    str_to_date(concat(if(birthMonth="", NULL, birthMonth), "/",
        if(birthDay="", NULL, birthDay), "/", if(birthYear="", NULL, birthYear)), "%m/%d/%Y") as DOB,
    str_to_date(concat(if(deathMonth="", NULL, deathMonth), "/",
        if(deathDay="", NULL, deathDay), "/", if(deathYear="", NULL, deathYear)), "%m/%d/%Y") as DOD,
    (-1 * datediff(str_to_date(concat(if(birthMonth="",NULL, birthMonth), "/",
        if(birthDay="", NULL, birthDay), "/", if(birthYear="", NULL, birthYear)), "%m/%d/%Y"), 
        str_to_date(concat(if(deathMonth="", NULL, birthMonth), "/", 
            if(deathDay="", NULL, deathDay), "/", if(deathYear="" , NULL, deathYear)), "%m/%d/%Y"))) as life_span
from people 
where playerid in (select playerid from appearances) and 
    (-1 * datediff(str_to_date(concat(if(birthMonth="",NULL, birthMonth), "/",
        if(birthDay="", NULL, birthDay), "/", if(birthYear="", NULL, birthYear)), "%m/%d/%Y"), 
        str_to_date(concat(if(deathMonth="", NULL, birthMonth), "/", 
            if(deathDay="", NULL, deathDay), "/", if(deathYear="" , NULL, deathYear)), "%m/%d/%Y"))) is not NULL
order by life_span desc
limit 10

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
10 rows affected.

/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/28/1919' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/21/1897' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/30/1888' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/7/1888' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/23/1910' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/25/1888' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/23/1896' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/4/1879' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/10/1897' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/21/1895' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/29/1888' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/20/1897' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/10/1899' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/9/1889' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/17/1909' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/9/1895' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/1/1881' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/8/1895' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/3/1891' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/7/1927' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/8/1893' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/5/1892' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/13/1891' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/28/1898' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/2/1901' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/27/1912' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/27/1886' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/26/1896' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/13/1885' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/10/1891' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/29/1931' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/24/1915' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/16/1888' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/13/1906' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/24/1895' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/31/1898' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/26/1884' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/9/1917' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/17/1893' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/20/1892' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/13/1900' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/4/1896' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/31/1893' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/17/1887' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/31/1907' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/2/1893' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/24/1905' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/24/1897' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/21/1907' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/30/1886' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/28/1913' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/5/1883' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/1/1898' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/21/1898' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/10/1885' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/6/1891' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/7/1944' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/19/1891' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/14/1875' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/25/1890' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/29/1916' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/19/1930' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/2/1928' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/20/1895' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/12/1918' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/5/1916' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/22/1900' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/7/1893' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/14/1899' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/10/1895' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/9/1901' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/16/1894' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/13/1903' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/20/1925' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/23/1904' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/29/1891' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/29/1894' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/13/1898' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/4/1882' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/23/1880' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/20/1889' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/17/1897' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/2/1899' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/19/1916' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/13/1921' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/5/1917' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/3/1902' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/26/1890' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/7/1908' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/9/1899' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/7/1905' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/7/1892' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/22/1886' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/31/1900' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/28/1894' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/28/1906' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/25/1898' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/19/1904' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/3/1894' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/15/1913' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/4/1904' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/23/1898' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/9/1887' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/10/1896' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/29/1892' for function str_to_date")
  result = self._query(query)
/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1411, "Incorrect datetime value: '/10/1881' for function str_to_date")

[('hoffch01', 'Hoff', 'Red', datetime.date(1891, 5, 8), datetime.date(1998, 9, 17), 39090),
 ('marreco01', 'Marrero', 'Connie', datetime.date(1911, 4, 25), datetime.date(2014, 4, 23), 37619),
 ('wrighbo01', 'Wright', 'Bob', datetime.date(1891, 12, 13), datetime.date(1993, 7, 30), 37272),
 ('malinto01', 'Malinosky', 'Tony', datetime.date(1909, 10, 7), datetime.date(2011, 2, 8), 37256),
 ('swanska01', 'Swanson', 'Karl', datetime.date(1900, 12, 17), datetime.date(2002, 4, 3), 37241),
 ('daleyjo01', 'Daley', 'John', datetime.date(1887, 5, 25), datetime.date(1988, 8, 31), 36896),
 ('stilero01', 'Stiles', 'Rollie', datetime.date(1906, 11, 17), datetime.date(2007, 7, 22), 36895),
 ('werbebi01', 'Werber', 'Billy', datetime.date(1908, 6, 20), datetime.date(2009, 1, 22), 36892),
 ('otisbi01', 'Otis', 'Bill', datetime.date(1889, 12, 24), datetime.date(1990, 12, 15), 36880),
 ('parkeac01', 'Parker', 'Ace', datetime.date(1912, 5, 17), datetime.date(2013, 11, 6), 36879)]

### Notes, Comments

## Odd Hall of Fame Members (10 points)

### Question

1. Use the table ```HallOfFame.``` A person is in the ```HallOfFame``` if there is a row with ```inducted='Y'```
<br><br>
1. A person was a player in __Major League Baseball__ if their ```playerID``` is in ```Appearances``` and a manager if their ```playerID``` is in ```Managers.```
<br><br>
1. Write a query that returns
    - playerID, nameLast, nameFirst, inducted, yearid, category
    - For people in the ```HallOfFame``` who were not players or managers in Major League Baseball.
<br><br>
1. Your answer __MUST__ match the sample answer.

### Answer

In [15]:
%%sql

10 rows affected.

[('bulkemo99', 'Bulkeley', 'Morgan', 'Y', 'Pioneer/Executive', '1937'),
 ('johnsba99', 'Johnson', 'Ban', 'Y', 'Pioneer/Executive', '1937'),
 ('cartwal99', 'Cartwright', 'Alexander', 'Y', 'Pioneer/Executive', '1938'),
 ('chadwhe99', 'Chadwick', 'Henry', 'Y', 'Pioneer/Executive', '1938'),
 ('landike99', 'Landis', 'Kenesaw', 'Y', 'Pioneer/Executive', '1944'),
 ('connoto99', 'Connolly', 'Tommy', 'Y', 'Umpire', '1953'),
 ('klembi99', 'Klem', 'Bill', 'Y', 'Umpire', '1953'),
 ('frickfo99', 'Frick', 'Ford', 'Y', 'Pioneer/Executive', '1970'),
 ('weissge99', 'Weiss', 'George', 'Y', 'Pioneer/Executive', '1971'),
 ('gibsojo99', 'Gibson', 'Josh', 'Y', 'Player', '1972')]

In [41]:
%%sql

select 
    playerid, 
    (select nameLast from people where people.playerID=halloffame.playerID) as nameLast, 
    (select nameFirst from people where people.playerID=halloffame.playerID) as nameFirst, 
    inducted, category, yearid 
from 
    halloffame 
where 
    playerid not in (select playerid from appearances) and 
    playerid not in (select playerid from managers) 
order by yearid asc 
limit 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
10 rows affected.

[('bulkemo99', 'Bulkeley', 'Morgan', 'Y', 'Pioneer/Executive', '1937'),
 ('johnsba99', 'Johnson', 'Ban', 'Y', 'Pioneer/Executive', '1937'),
 ('cartwal99', 'Cartwright', 'Alexander', 'Y', 'Pioneer/Executive', '1938'),
 ('chadwhe99', 'Chadwick', 'Henry', 'Y', 'Pioneer/Executive', '1938'),
 ('landike99', 'Landis', 'Kenesaw', 'Y', 'Pioneer/Executive', '1944'),
 ('connoto99', 'Connolly', 'Tommy', 'Y', 'Umpire', '1953'),
 ('klembi99', 'Klem', 'Bill', 'Y', 'Umpire', '1953'),
 ('frickfo99', 'Frick', 'Ford', 'Y', 'Pioneer/Executive', '1970'),
 ('weissge99', 'Weiss', 'George', 'Y', 'Pioneer/Executive', '1971'),
 ('gibsojo99', 'Gibson', 'Josh', 'Y', 'Player', '1972')]

### Notes, Comments

## Teams that Played in Boston (10 points)

### Question

1. The ```Teams``` table contains information about teams and their seasons. Interesting columns are:
    - ```teamID```
    - ```franchID```
    - ```name```
    - ```park,``` which is the name of the facility (stadium) in which the team played.
<br><br>
1. The ```Parks``` table contains information about park names, their cities and states.
<br><br>
1. JOINing ```Teams``` and ```Parks``` should enable finding teams that played in cities, except the ```Teams``` table and ```Parks``` table sometimes have slightly different names for the park/stadium. This requires matching instead equality.
<br><br>
1. Write a query that returns the ```teamID, franchID, team name, park.name``` from ```Parks``` for all teams that played in Boston.
<br><br>
1. Your answer __MUST__ exactly match the sample answer.

### Answer

In [16]:
%%sql

20 rows affected.

[('BSN', 'ATL', 'Boston Beaneaters', 'South End Grounds I'),
 ('BSN', 'ATL', 'Boston Beaneaters', 'South End Grounds II'),
 ('BSN', 'ATL', 'Boston Beaneaters', 'Congress Street Grounds'),
 ('BSN', 'ATL', 'Boston Beaneaters', 'South End Grounds III'),
 ('BSN', 'ATL', 'Boston Bees', 'Braves Field'),
 ('BSN', 'ATL', 'Boston Braves', 'South End Grounds I'),
 ('BSN', 'ATL', 'Boston Braves', 'South End Grounds II'),
 ('BSN', 'ATL', 'Boston Braves', 'South End Grounds III'),
 ('BSN', 'ATL', 'Boston Braves', 'Fenway Park'),
 ('BSN', 'ATL', 'Boston Braves', 'Braves Field'),
 ('BSN', 'ATL', 'Boston Doves', 'South End Grounds I'),
 ('BSN', 'ATL', 'Boston Doves', 'South End Grounds II'),
 ('BSN', 'ATL', 'Boston Doves', 'South End Grounds III'),
 ('BSN', 'ATL', 'Boston Red Caps', 'South End Grounds I'),
 ('BOS', 'BOS', 'Boston Red Sox', 'Fenway Park'),
 ('BS1', 'BNA', 'Boston Red Stockings', 'South End Grounds I'),
 ('BS2', 'BRS', 'Boston Reds', 'Congress Street Grounds'),
 ('BSN', 'ATL', 'Boston Rustlers', 'South End Grounds I'),
 ('BSN', 'ATL', 'Boston Rustlers', 'South End Grounds II'),
 ('BSN', 'ATL', 'Boston Rustlers', 'South End Grounds III')]

In [45]:
%%sql
select distinct teamid, franchid, a.team_name, b.`park.name` 
from 
    (SELECT 
        distinct teamid, franchid, name as team_name, park from Teams where park != "") as a 
join 
    (select * from parks) as b 
where 
    b.city = "Boston" and a.park like concat("%", b.`park.name`, "%")
order by team_name

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
20 rows affected.

[('BSN', 'ATL', 'Boston Beaneaters', 'South End Grounds III'),
 ('BSN', 'ATL', 'Boston Beaneaters', 'South End Grounds I'),
 ('BSN', 'ATL', 'Boston Beaneaters', 'South End Grounds II'),
 ('BSN', 'ATL', 'Boston Beaneaters', 'Congress Street Grounds'),
 ('BSN', 'ATL', 'Boston Bees', 'Braves Field'),
 ('BSN', 'ATL', 'Boston Braves', 'South End Grounds II'),
 ('BSN', 'ATL', 'Boston Braves', 'South End Grounds III'),
 ('BSN', 'ATL', 'Boston Braves', 'Fenway Park'),
 ('BSN', 'ATL', 'Boston Braves', 'Braves Field'),
 ('BSN', 'ATL', 'Boston Braves', 'South End Grounds I'),
 ('BSN', 'ATL', 'Boston Doves', 'South End Grounds I'),
 ('BSN', 'ATL', 'Boston Doves', 'South End Grounds II'),
 ('BSN', 'ATL', 'Boston Doves', 'South End Grounds III'),
 ('BSN', 'ATL', 'Boston Red Caps', 'South End Grounds I'),
 ('BOS', 'BOS', 'Boston Red Sox', 'Fenway Park'),
 ('BS1', 'BNA', 'Boston Red Stockings', 'South End Grounds I'),
 ('BS2', 'BRS', 'Boston Reds', 'Congress Street Grounds'),
 ('BSN', 'ATL', 'Boston Rustlers', 'South End Grounds I'),
 ('BSN', 'ATL', 'Boston Rustlers', 'South End Grounds II'),
 ('BSN', 'ATL', 'Boston Rustlers', 'South End Grounds III')]

### Notes, Comments

- Two point bonus question: Why would someone name a team in Boston the "Beaneaters?"


- Hint: Below is part of a famous toast,

_"And this is good old Boston, <br>
The home of the bean and the cod. <br>
Where the Lowells talk only to Cabots, <br>
And the Cabots talk only to God."_ <br>
<br>
John Collins Bossidy: A toast given at Holy Cross College alumni dinner in 1910.


- Enter you explanation here.

# Relational/Document Mapping (15 points)

## Question

### Schema

- Tables: The two tables below represent ```Orders``` and ```OrderDetails```


- ```orderdetails``` is a [Weak Entity](https://en.wikipedia.org/wiki/Weak_entity) that depends on and is logically contained inside an ```order.```

```
CREATE TABLE `orders` (
  `orderNumber` int(11) NOT NULL,
  `orderDate` date NOT NULL,
  `requiredDate` date NOT NULL,
  `shippedDate` date DEFAULT NULL,
  `status` varchar(15) NOT NULL,
  `comments` text,
  `customerNumber` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;


CREATE TABLE `orderdetails` (
  `orderNumber` int(11) NOT NULL,
  `productCode` varchar(15) NOT NULL,
  `quantityOrdered` int(11) NOT NULL,
  `priceEach` decimal(10,2) NOT NULL,
  `orderLineNumber` smallint(6) NOT NULL,
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

```

- You must create the tables in a new schema you create. The schema name is of the form "uni_midterm" Please replace the string "uni" with your UNI. If your answer does do the replacement and your schema is "uni_midterm", we will chuckle and shake our heads.


- You also must define a primary key in each table and any foreign key relationships. ```orderNumber``` is the primary key in ```orders.```

### Question Tasks

1. Create the tables in a schema called `uni_midterm` and replace "uni" with your UNI.
<br><br>
1. Write a python function ```create_order(o)``` that
    1. Takes a data structure like the onea below.
    2. Inserts the order fields in the ```order``` table and the order details information in the ```orderdetails``` table.
    3. There are sample JSON for orders/ordersdetails below.
<br><br>
1. Your code must generate a unique ```orderNumber``` for the created order.
<br><br>
1. The function returns the ```orderNumber``` for the created order.
<br><br>
1. You may modify the table schema if you want.
<br><br>
1. Test your function on the two orders below.
<br><br>
1. Write a SQL query that returns information about an order and its details.

```
{
    "order":
        {
            "orderDate": "2003-01-06",
            "requiredDate": "2003-01-13",
            "shippedDate": "2003-01-10",
            "status": "Shipped",
            "comments": null,
            "customerNumber": 363
        },
    "orderdetails": 
        [
        {
            "productCode": "S24_3969",
            "quantityOrdered": 49,
            "priceEach": "35.29",
            "orderLineNumber": 1
        },
        {
            "productCode": "S18_2248",
            "quantityOrdered": 50,
            "priceEach": "55.09",
            "orderLineNumber": 2
        },
        {
            "productCode": "S18_1749",
            "quantityOrdered": 30,
            "priceEach": "136.00",
            "orderLineNumber": 3
        },
        {
            "productCode": "S18_4409",
            "quantityOrdered": 22,
            "priceEach": "75.46",
            "orderLineNumber": 4
        }
    ]
}
```

```
{
    "order":
        "orderDate": "2003-01-09",
        "requiredDate": "2003-01-18",
        "shippedDate": "2003-01-11",
        "status": "Shipped",
        "comments": "Check on availability.",
        "customerNumber": 128
    }
    "orderdetails": [
    {
            "orderNumber": 10101,
            "productCode": "S18_2795",
            "quantityOrdered": 26,
            "priceEach": "167.06",
            "orderLineNumber": 1
        },
        {
            "orderNumber": 10101,
            "productCode": "S24_2022",
            "quantityOrdered": 46,
            "priceEach": "44.35",
            "orderLineNumber": 2
        },
        {
            "orderNumber": 10101,
            "productCode": "S24_1937",
            "quantityOrdered": 45,
            "priceEach": "32.53",
            "orderLineNumber": 3
        },
        {
            "orderNumber": 10101,
            "productCode": "S18_2325",
            "quantityOrdered": 25,
            "priceEach": "108.06",
            "orderLineNumber": 4
        }
    ]
}
```

## Answer

### Schema and Table Creation

In [46]:
%%sql
create schema yw3231_midterm

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
1 rows affected.

[]

In [59]:
#%sql use yw3231_midterm
%sql use lahman2017raw

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.

[]

In [58]:
%%sql
CREATE TABLE `orders` ( 
    `orderNumber` int(11) NOT NULL, 
    `orderDate` date NOT NULL, 
    `requiredDate` date NOT NULL, 
    `shippedDate` date DEFAULT NULL, 
    `status` varchar(15) NOT NULL, 
    `comments` text, 
    `customerNumber` int(11) NOT NULL, 
    PRIMARY KEY (`orderNumber`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8; 

CREATE TABLE `orderdetails` (
    `orderNumber` int(11) NOT NULL, 
    `productCode` varchar(15) NOT NULL, 
    `quantityOrdered` int(11) NOT NULL, 
    `priceEach` decimal(10,2) NOT NULL, 
    `orderLineNumber` smallint(6) NOT NULL, 
    PRIMARY KEY (`orderNumber`, `orderLineNumber`), 
    KEY `ol_to_p_idx` (`productCode`), 
    CONSTRAINT `od_to_o` FOREIGN KEY (`orderNumber`) REFERENCES `orders` (`orderNumber`) 
    ON DELETE NO ACTION ON UPDATE NO ACTION 
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.
0 rows affected.

/anaconda2/envs/databases/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (3719, "'utf8' is currently an alias for the character set UTF8MB3, but will be an alias for UTF8MB4 in a future release. Please consider using UTF8MB4 in order to be unambiguous.")
  result = self._query(query)

[]

### Python Functions

In [88]:
def get_maximum_value(dbname, tablename, column, cursor=None, commit=True):
    
    result2 = None 
    
    q = "select max(" + column + ") as max_v from " + dbname + "." + tablename 
    
    result = run_q(cnx=None, q=q, args=None, commit=commit, cursor=cursor, fetch=True) 
    
    if result and len(result) > 0:
        result2 = result[0].get('max_v', None)
        if result2 is None: 
            result2 = 0 
    else: 
        result2 = 0 
        
    return result2

In [89]:
print(get_maximum_value('yw3231_midterm', 'orders', 'orderNumber'))

0

In [84]:
def insert(dbname, tablename, new_r, cnx=None, cursor=None, commit=None, rowid=None):

    cols = list(new_r.keys()) 
    args = [new_r(k) for k in cols]
    
    slots = ['%s' for c in cols]
    
    cols = " (" + ",".join(cols) + ") " 
    vale = " values(" + ",".join(slots) + ") " 
    tbl = dbname + + tablename 
    
    q = "insert into " + tbl + " " + cols + " " + vals 
    result = run_q(cnx=cnx, q=q, args=args, commit=commit, rowid=rowid, cursor=cursor) 

    return result 

def insert_doc(dbname, doc, key_col, cursor=None, commit=None):
    
    cnx = get_connection("docs", 
                         host="localhost", 
                         port=3306, 
                         db="yw3231_midterm", 
                         user="dbuser", 
                         password="dbuserdbuser") 
    
    try: 
        cursor = cnx.cursor() 
        
        keys = list(doc.keys()) 
        pk = keys[0]
        max_v = get_maximum_value(dbname, keys[0], key_col, cursor=cursor, commit=False) 
        
        max_v += 1 
        root = doc[keys[0]] 
        root[key_col] = max_v 
        
        r = insert(dbname, keys[0], doc[keys[0]], cursor=cursor, commit=False) 
        
        for k in keys[1:]:
            tbl = doc[k]
            for r in tbl:
                r[key_col] = max_v
                tmp = insert(dbname, k, r, cursor=curosr, commit=False)
                
        cnx.commit()
        cnx.close()
        
    except Exception as e:
        print("Exception ", e)
        cnx.commit()
        cnx.close()
        
    return max_v

In [85]:
def create_order(order):
      return insert_doc("yw3231_midterm", order, 'orderNumber')

### Tests

We __MAY__ test your code and SQL statements.

#### Test Data

In [79]:
o_all_1 = {
    "orders":
        {
            "orderDate": "2003-01-06",
            "requiredDate": "2003-01-13",
            "shippedDate": "2003-01-10",
            "status": "Shipped",
            "comments": None,
            "customerNumber": 363
        },
    "orderdetails": 
        [
        {
            "productCode": "S24_3969",
            "quantityOrdered": 49,
            "priceEach": "35.29",
            "orderLineNumber": 1
        },
        {
            "productCode": "S18_2248",
            "quantityOrdered": 50,
            "priceEach": "55.09",
            "orderLineNumber": 2
        },
        {
            "productCode": "S18_1749",
            "quantityOrdered": 30,
            "priceEach": "136.00",
            "orderLineNumber": 3
        },
        {
            "productCode": "S18_4409",
            "quantityOrdered": 22,
            "priceEach": "75.46",
            "orderLineNumber": 4
        }
    ]
}

In [82]:
o_all_2 = {
    "orders":
        {
            "orderDate": "2003-01-06",
            "requiredDate": "2003-01-13",
            "shippedDate": "2003-01-10",
            "status": "Shipped",
            "comments": None,
            "customerNumber": 363
        },
    "orderdetails": 
        [
        {
            "productCode": "S24_3969",
            "quantityOrdered": 49,
            "priceEach": "35.29",
            "orderLineNumber": 1
        },
        {
            "productCode": "S18_2248",
            "quantityOrdered": 50,
            "priceEach": "55.09",
            "orderLineNumber": 2
        },
        {
            "productCode": "S18_1749",
            "quantityOrdered": 30,
            "priceEach": "136.00",
            "orderLineNumber": 3
        },
        {
            "productCode": "S18_4409",
            "quantityOrdered": 22,
            "priceEach": "75.46",
            "orderLineNumber": 4
        }
    ]
}

#### Test Execution

In [90]:
#create_order(o_all_1)
o_all_1.keys()

dict_keys(['orders', 'orderdetails'])

In [ ]:
order = {
    "orderDate": "2003-01-06",
    "requiredDate": "2003-01-13",
    "shippedDate": "2003-01-10",
    "status": "Shipped",
    "comments": None,
    "customerNumber": 363
}

#### SQL Query

In [ ]:
%%sql

## Notes, Comments

# Data Modeling (15 points)

## Question

- __Note:__ Use the schema uni_midterm for these tables.


- The _Contact_ application's conceptual data model has the following _conceptual entities and properties._ 


- The properties in the _conceptual model do not necessarily map directly to columns_ in the _logical_ and _physical_ models.


- _Person:_

| Property | Type | Example | Comments |
| :---: | :---: |
| id | Integer | 21 | Auto-incremented; primary key |
| Name | String | "Donald Ferguson" | |
| Created | Datetime | 2019-03-06 10:51:59 | |


<br>
- _Email:_ 

| Property | Type | Example | Comments |
| :---: | :---: |
| id | Integer | 21 | Auto-incremented; primary key |
| email | String | "dff9@mars.gov" | |


<br><br>
- _Phone:_ 

| Property | Type | Example | Comments |
| :---: | :---: |
| id | Integer | 11 | Auto-incremented; primary key |
| Phone | String | "+1 914-555-1212" | |

<br>
<br>
- _Address:_ 

| Property | Type | Example | Comments |
| :---: | :---: |
| id | Integer | 101 | Auto-incremented; primary key |
| Street | String | "620 W. 120th Street" | |
| City | String | "Boston" | |
| State | String | "MA" | |
| Country | String | "France" |
| Postcode | String | "12345" |


- _Contact Types:_ These represents the types of relationships. There can be __at most__ one instance of the relationship between a person and a contact type. For example, a person can have at most one _business email._ The predefined contact types are:
    - _Personal_
    - _Business_
    - _Home_
    - _Other_
    
    
- A _Person_ may have have contacts of more than one type, and a specific contact entity may apply to more than one person.
    
    
- Define and implement a physical schema that realizes the model.
    - Define the tables.
    - Create the reverse engineered model into a diagram.

## Answer

- Your diagram and table create statements go here.

## Notes and Comments

# Data Cleanse (15 points)

## Question

- Importing raw data from CSV files and other sources is very common in all disciplines that use databases. 


- Data science, analytics and general application development regularly require cleaning up the raw data.


- ```People``` from Lahman2017 is an example of raw data that requires schema and data cleanup. The table definition that the MySql import tool produces is below.


- Convert the table to a cleaner, more useful form. You do not need to worry about other tables and foreign keys. This means:
    - Change the schema (column types, constraints, etc)
    - You may have to consolidate columns, add columns and drop columns.
    - Modify the data to match the schema.
    - Run a query with limit 10 to show the transformed date and schema.


- Do not ask, "How many improvements are necessary?" The answer is, "All of them."

```
CREATE TABLE `People` (
  `playerID` text,
  `birthYear` text,
  `birthMonth` text,
  `birthDay` text,
  `birthCountry` text,
  `birthState` text,
  `birthCity` text,
  `deathYear` text,
  `deathMonth` text,
  `deathDay` text,
  `deathCountry` text,
  `deathState` text,
  `deathCity` text,
  `nameFirst` text,
  `nameLast` text,
  `nameGiven` text,
  `weight` text,
  `height` text,
  `bats` text,
  `throws` text,
  `debut` text,
  `finalGame` text,
  `retroID` text,
  `bbrefID` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

```

- Implement the cleanup. This involves:
    - Providing your final table definition.
    - SQL statements you used to probe/examine the data.
    - SQL statements you used to transform the data to comply with the new table definition.
    

## Answer

- The answer below contains the SQL statements you used to
    - Probe the data for understanding.
    - Alter data in the database.
    - Modify the schema.


- We __MAY__ test your SQL.

In [ ]:
%sql statements

## Notes and Comments

# Inheritance, Triggers and Stored Procedures (15 points)

## Question

- The last lecture covered a 3 table solution to inheritance for ```Person, Student``` and ```Faculty.```


- The entity types are the following:


- _Person:_

| Property | Type | Example | Comments |
| :---: | :---: |
| uni | varchar | "dff9" | Computed by database functions; immutable. |
| last_name | varchar | "Ferguson" | |
| first_name | varchar | "Donald" | |
| type | enum("Student", "Faculty", "Multiple") | "Student" | |
| created | Datetime | 2019-03-06 10:51:59 | Immutable. Generated on create. |


- _Faculty:_ A faculty entity is a subclass ("IsA") _Person_ and has all of the properties of _Person._ _Faculty_ has the following additional properties.

| Property | Type | Example | Comments |
| :---: | :---: |
| title | varchar | "Terrifying database professor" | |
| department | varchar | "Computer Science" | |


- _Student:_ A student entity is a subclass ("IsA") _Person_ and has all of the properties of _Person._ _Student_ has the following additional properties.

| Property | Type | Example | Comments |
| :---: | :---: |
| enrollment_year | Date | 2019-09-01 | |
| major | varchar | "Computer Science, but seriously reevaluating life choices and probably changing because of W4111. Yak herding looks pretty good now." | |



- Requirements
    - Solve the problem using a [two table solution.](https://www.vertabelo.com/blog/technical-articles/inheritance-in-a-relational-database)
    - The model is __COMPLETE.__ There are no _Person_ entities that are neither _Student_ or _Faculty._
    - The model is __NOT__ disjoint. There are _Person_ entities that are both a _Student_ and a _Faculty._
    - You __MUST:__
        - Generate the UNI using first name and last name. This requires a function and triggers.
        - Enforce immutability for ```uni``` and ```created.``` This requires triggers.
        - Provide a procedure ```create_person().``` This procedures's parameters are the fields necessary to create a _Student_ and _Faculty._ The procedure creates the _Student_ entry, _Faculty_ entry or both depending on the inputs.
        - A _view_ that supports ```SELECT``` on _Person._
        - Create a new database user "default_user" with password "dbuserdbuser."
        - Demonstrate the "default_user"
            - Cannot access the tables.
            - Can call ```create_person()```
            - Can query the _Person_ view.
            
        
- Use the schema "uni_midterm".


- We will test the answer you provide in the code cells below.

## Answer

### Create Table/View Statements

In [ ]:
%sql create statements

### Create Trigger, Function and Procedure Statements

In [ ]:
%sql create statements

### Tests

#### Create 3 Students, 3 Faculty Members and Two Persons that are Both.

In [ ]:
%sql data creations

#### Demonstrate Queries

Write queries that return:
- All students
- All faculty
- All persons that are both.

In [ ]:
%sql queries

#### User Rights

- Execute the following SQL statement.

In [ ]:
%sql SHOW GRANTS FOR 'default_user'@'localhost';